---
type: ComboBox
namespace: Autodesk.Revit.UI
version: 2024
members: 9
tags: [revit-api, class]
---

# ComboBox

`Autodesk.Revit.UI.ComboBox` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Event | CurrentChanged | — | `public event EventHandler < ComboBoxCurrentChangedEventArgs > CurrentChanged` |
| Event | DropDownClosed | — | `public event EventHandler < ComboBoxDropDownClosedEventArgs > DropDownClosed` |
| Event | DropDownOpened | — | `public event EventHandler < ComboBoxDropDownOpenedEventArgs > DropDownOpened` |
| Method | AddItem | 2011 | `public ComboBoxMember AddItem ( ComboBoxMemberData memberData )` |
| Method | AddItems | 2011 | `public IList < ComboBoxMember > AddItems ( IList < ComboBoxMemberData > memberData )` |
| Method | AddSeparator | 2011 | `public void AddSeparator ()` |
| Method | GetItems | 2011 | `public IList < ComboBoxMember > GetItems ()` |
| Property | Current | 2011 | `public ComboBoxMember Current { get ; set ; }` |
| Property | Image | 2011 | `public ImageSource Image { get ; set ; }` |